apple-open-source/macos/IOUSBFamily/AppleUSBHub/Classes/AppleUSBHub.cpp
const char *	
AppleUSBHub::HubMessageToString(UInt32 message)
{
	switch (message)
	{
		case kIOUSBMessageHubIsDeviceConnected:
			return "kIOUSBMessageHubIsDeviceConnected";
		case kIOUSBMessageHubSuspendPort:
			return "kIOUSBMessageHubSuspendPort";
		case kIOUSBMessageHubResumePort:
			return "kIOUSBMessageHubResumePort";
		case kIOUSBMessageHubResetPort:
			return "kIOUSBMessageHubResetPort";
		case kIOUSBMessageHubPortClearTT:
			return "kIOUSBMessageHubPortClearTT";
		case kIOUSBMessageHubSetPortRecoveryTime:
			return "kIOUSBMessageHubSetPortRecoveryTime";
		case kIOUSBMessageHubReEnumeratePort:
			return "kIOUSBMessageHubReEnumeratePort";
		case kIOMessageServiceIsTerminated: 	
			return "kIOMessageServiceIsTerminated";
		case kIOUSBMessagePortHasBeenReset:
			return "kIOUSBMessagePortHasBeenReset";
		case kIOUSBMessagePortHasBeenResumed:
			return "kIOUSBMessagePortHasBeenResumed";
		case kIOUSBMessagePortWasNotSuspended:
			return "kIOUSBMessagePortWasNotSuspended";
		case kIOMessageServiceIsRequestingClose:
			return "kIOMessageServiceIsRequestingClose";
		case kIOMessageServiceIsAttemptingOpen:
			return "kIOMessageServiceIsAttemptingOpen";
		case kIOUSBMessagePortHasBeenSuspended:
			return "kIOUSBMessagePortHasBeenSuspended";
		default:
			return "UNKNOWN";
	}
}



void
AppleUSBHub::EnsureUsabilityEntry(OSObject *target)
{
    AppleUSBHub *	me = OSDynamicCast(AppleUSBHub, target);
	
    if (!me)
        return;
	
	USBLog(7, "AppleUSBHub[%p]::EnsureUsabilityEntry - calling in", me);
	me->EnsureUsability();
	USBLog(7, "AppleUSBHub[%p]::EnsureUsabilityEntry - done", me);
}



//================================================================================================
//   EnsureUsability
//		Override the IOUSBHubPolicymaker implementation in order to make sure that we 
//		are not in the CheckForActivePorts thread when we get to the superclass method
//================================================================================================

IOReturn		
AppleUSBHub::EnsureUsability(void)
{
	UInt32			retries = 200;
	
	if (_workLoop->inGate())
	{
		USBLog(7, "AppleUSBHub[%p]::EnsureUsability - called inGate - spawning thread instead", this);
		thread_call_enter(_ensureUsabilityThread);
		return kIOReturnSuccess;
	}
	
	USBLog(7, "AppleUSBHub[%p]::EnsureUsability - setting _abandonCheckPorts, inGate(%s)", this, _workLoop->inGate() ? "true" : "false");

	_abandonCheckPorts = true;
	// wait up to 400 ms for us to complete the CheckForActivePorts
	while (_checkPortsThreadActive && retries--)
	{
		// make sure that the CheckForActivePorts thread is not running. we have already told it to abandon ship
		// but it may or may not have noticed that before lowering the power state. at any rate, once it is no longer
		// active, then we can raise the power state and all should be well
		USBLog(5, "AppleUSBHub[%p]::EnsureUsability - _checkPortsThreadActive, sleeping 2 ms (retries %d)", this, (int)retries);
		IOSleep(2);
	}
	if (_checkPortsThreadActive)
	{
		USBLog(1, "AppleUSBHub[%p]::EnsureUsability - _checkPortsThreadActive after delay!", this);
	}
	USBLog(7, "AppleUSBHub[%p]::EnsureUsability - clearing _abandonCheckPorts, inGate(%s)", this, _workLoop->inGate() ? "true" : "false");
	_abandonCheckPorts = false;
	return super::EnsureUsability();
}
